# Вариант 15

# Даны целочисленные координаты точки на плоскости. 
# Если точка совпадает с началом координат, то вывести 0. 
# Если точка не совпадает с началом координат, но лежит на оси OX или OY, то вывести соответственно 1 или 2. 
# Если точка не лежит на координатных осях, то вывести 3.

x = input("Введите координату X: ")
y = input("Введите координату Y: ") 

while type(x) != int:
    try:
        x = int(x)
    except:
        print("Неправильно ввели!")
        x = input("Введите координату X: ")

while type(y) != int:
    try:
        y = int(x)
    except:
        print("Неправильно ввели!")
        y = input("Введите координату Y: ")

if x == 0 and y == 0:
    print("0")
elif x != 0 and y == 0:
    print("1")
elif x == 0 and y != 0:
    print("2")
elif x != 0 and y != 0:
    print("3")