# Вариант 15. 
# Дано трехзначное число. 
# Вывести вначале его последнюю цифру (единицы), а затем — его среднюю цифру (десятки).


num = int(input("Введите трехзначное число: "))
num_ed = num % 10
num_des = (num // 10) % 10
print("Вариант 16. Единицы и десятки", num_ed, num_des)



# Дальше решала для себя разные варианты


# Вариант 14
# Дано трехзначное число. 
# Используя одну операцию деления нацело,вывести первую цифру данного числа (сотни)

#num = int(input())
num_sotni = num // 100
print("Вариант 14. Первая цифра числа ", num_sotni)


# Вариант 16. 
# Дано трехзначное число. 
# Найти сумму и произведение его цифр.

#num = int(input())
summa = num_ed + num_des + num_sotni
product = num_ed * num_des * num_sotni
print("Вариант 16. Сумма и произведение", summa, product)


# Вариант 17.
# Дано трехзначное число. 
# Вывести число, полученное при прочтении исходного числа справа налево

#num = int(input())
new_num = num_ed * 100 + num_des * 10 + num_sotni
print("Вариант 17. Число справа налево", new_num)


#Вариант 18. 
# Дано трехзначное число. 
# В нем зачеркнули первую слева цифру и приписали ее справа. Вывести

#num = int(input())
new1_num = (num_des * 10 + num_ed) * 10 + num_sotni
print("Вариант 18. Сотни в конце", new1_num)


#Вариант 19. 
# Дано трехзначное число. 
# В нем зачеркнули первую справа цифру и приписали ее слева. Вывести полученное число.

#num = int(input())
new2_num = num_ed * 100 + num_sotni * 10 + num_des
print("Вариант 19. Единицы в начале", new2_num)

#Вариант 20. 
# Дано трехзначное число. 
# Вывести число, полученное при перестановке цифр сотен и десятков исходного числа (например, 123 перейдет в 213).